app/controllers/dashboard_controller.rb

  def index
    @habits = current_user.habits.includes(:habit_checkins)
---
SELECT "habit_checkins".* FROM "habit_checkins" WHERE "habit_checkins"."habit_id" IN ($1, $2)  [["habit_id", 1], ["habit_id", 2]]
SELECT "habits".* FROM "habits" WHERE "habits"."user_id" = $1  [["user_id", 1]]