app/controllers/habits_controller.rb

SELECT "habit_checkins".* FROM "habit_checkins" WHERE "habit_checkins"."habit_id" IN ($1, $2)  [["habit_id", 1], ["habit_id", 2]]
SELECT "habits".* FROM "habits" WHERE "habits"."user_id" = $1  [["user_id", 1]]
---
  def index
    @habits = current_user.habits.includes(:habit_checkins)

SELECT "habits".* FROM "habits" WHERE "habits"."user_id" = $1 AND "habits"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "habit_checkins".* FROM "habit_checkins" WHERE "habit_checkins"."habit_id" = $1 AND "habit_checkins"."checked_on" = $2 LIMIT $3  [["habit_id", 1], ["checked_on", "2025-06-04"], ["LIMIT", 1]]
---
  def check_in
	  @habit = current_user.habits.find(params[:id])
	  date = params[:date] ? Date.parse(params[:date]) : Date.today

	  checkin = @habit.habit_checkins.find_or_initialize_by(checked_on: date)

SELECT "habits".* FROM "habits" WHERE "habits"."user_id" = $1 AND "habits"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def set_habit
    @habit = current_user.habits.find(params[:id])